Dummy Sampler.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.6.2">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="Test Plan" enabled="true">
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.tearDown_on_shutdown">false</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
    </TestPlan>
    <hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Thread Group" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
          <stringProp name="LoopController.loops">1</stringProp>
          <boolProp name="LoopController.continue_forever">false</boolProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">5</stringProp>
        <stringProp name="ThreadGroup.ramp_time">1</stringProp>
        <boolProp name="ThreadGroup.delayedStart">false</boolProp>
        <boolProp name="ThreadGroup.scheduler">false</boolProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
      </ThreadGroup>
      <hashTree>
        <kg.apc.jmeter.samplers.DummySampler guiclass="kg.apc.jmeter.samplers.DummySamplerGui" testclass="kg.apc.jmeter.samplers.DummySampler" testname="Dummy Sampler - GET" enabled="true">
          <boolProp name="WAITING">true</boolProp>
          <boolProp name="SUCCESFULL">true</boolProp>
          <stringProp name="RESPONSE_CODE">200</stringProp>
          <stringProp name="RESPONSE_MESSAGE">OK</stringProp>
          <stringProp name="RESPONSE_DATA">{
&quot;trainerName&quot; : &quot;Kiran&quot;,
&quot;courseName&quot; : &quot;JMeter-Performance Testing&quot;,
&quot;mode&quot; : &quot;Online&quot;,
&quot;cost&quot; : &quot;${__Random(50,500)}$&quot;
}</stringProp>
          <stringProp name="RESPONSE_TIME">150</stringProp>
          <stringProp name="LATENCY">121</stringProp>
          <stringProp name="CONNECT">${__Random(1,5)}</stringProp>
          <stringProp name="RESULT_CLASS">org.apache.jmeter.samplers.SampleResult</stringProp>
        </kg.apc.jmeter.samplers.DummySampler>
        <hashTree/>
        <kg.apc.jmeter.samplers.DummySampler guiclass="kg.apc.jmeter.samplers.DummySamplerGui" testclass="kg.apc.jmeter.samplers.DummySampler" testname="Dummy Sampler - POST" enabled="true">
          <boolProp name="WAITING">false</boolProp>
          <boolProp name="SUCCESFULL">true</boolProp>
          <stringProp name="RESPONSE_CODE">201</stringProp>
          <stringProp name="RESPONSE_MESSAGE">Created</stringProp>
          <stringProp name="REQUEST_DATA">{
&quot;name&quot; : &quot;Kiran&quot;,
&quot;job&quot; : &quot;Automation Specialist&quot;
}</stringProp>
          <stringProp name="RESPONSE_DATA">{
&quot;id&quot; : &quot;${__Random(50,500)}&quot;,
&quot;name&quot; : &quot;Kiran&quot;,
&quot;job&quot; : &quot;Automation Specialist&quot;,
&quot;message&quot; : &quot;User is created successfully&quot;
}</stringProp>
          <stringProp name="RESPONSE_TIME">151</stringProp>
          <stringProp name="LATENCY">122</stringProp>
          <stringProp name="CONNECT">${__Random(1,50)}</stringProp>
          <stringProp name="RESULT_CLASS">org.apache.jmeter.samplers.SampleResult</stringProp>
        </kg.apc.jmeter.samplers.DummySampler>
        <hashTree/>
        <kg.apc.jmeter.samplers.DummySampler guiclass="kg.apc.jmeter.samplers.DummySamplerGui" testclass="kg.apc.jmeter.samplers.DummySampler" testname="Dummy Sampler - PUT" enabled="true">
          <boolProp name="WAITING">true</boolProp>
          <boolProp name="SUCCESFULL">true</boolProp>
          <stringProp name="RESPONSE_CODE">202</stringProp>
          <stringProp name="RESPONSE_MESSAGE">Accepted</stringProp>
          <stringProp name="REQUEST_DATA">{
&quot;id&quot; : &quot;999&quot;,
&quot;name&quot; : &quot;G.Kiran&quot;,
&quot;job&quot; : &quot;Performance Automation Specialist&quot;
}</stringProp>
          <stringProp name="RESPONSE_DATA">{
&quot;id&quot; : &quot;999&quot;,
&quot;name&quot; : &quot;G.Kiran&quot;,
&quot;job&quot; : &quot;Performance Automation Specialist&quot;,
&quot;message&quot; : &quot;User is updated successfully&quot;
}</stringProp>
          <stringProp name="RESPONSE_TIME">152</stringProp>
          <stringProp name="LATENCY">122</stringProp>
          <stringProp name="CONNECT">${__Random(50,500)}</stringProp>
          <stringProp name="RESULT_CLASS">org.apache.jmeter.samplers.SampleResult</stringProp>
        </kg.apc.jmeter.samplers.DummySampler>
        <hashTree/>
        <kg.apc.jmeter.samplers.DummySampler guiclass="kg.apc.jmeter.samplers.DummySamplerGui" testclass="kg.apc.jmeter.samplers.DummySampler" testname="Dummy Sampler - DELETE" enabled="true">
          <boolProp name="WAITING">true</boolProp>
          <boolProp name="SUCCESFULL">true</boolProp>
          <stringProp name="RESPONSE_CODE">204</stringProp>
          <stringProp name="RESPONSE_MESSAGE">No Content</stringProp>
          <stringProp name="REQUEST_DATA">{
&quot;id&quot; : &quot;999&quot;
}</stringProp>
          <stringProp name="RESPONSE_TIME">${__Random(50,500)}</stringProp>
          <stringProp name="LATENCY">123</stringProp>
          <stringProp name="CONNECT">104</stringProp>
          <stringProp name="RESULT_CLASS">org.apache.jmeter.samplers.SampleResult</stringProp>
        </kg.apc.jmeter.samplers.DummySampler>
        <hashTree/>
        <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="View Results Tree" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
        <ResultCollector guiclass="TableVisualizer" testclass="ResultCollector" testname="View Results in Table" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
      </hashTree>
    </hashTree>
  </hashTree>
</jmeterTestPlan>